src/Enums/onyx_СтатусДоступаСессии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_СтатусДоступаСессии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Публичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приватный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/onyx_ТипЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_ТипЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСпискаАгентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/onyx_ТипОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_ТипОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеТокена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСпискаАгентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/onyx_СессииЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>onyx_СессииЧата</Name>
			<Comment>Хранение метаданных сессий чата из Onyx</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.onyx_Агенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщениеID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_СтатусДоступаСессии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/onyx_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>onyx_Агенты</Name>
			<Comment>Хранение метаданных AI-агентов из Onyx</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Метки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/onyx_РаботаССессиямиЧата/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Создает новую сессию чата и возвращает ссылку на элемент справочника.
//
// Параметры:
//   ИдентификаторАгента - Число - идентификатор агента Onyx.
//   ОписаниеСессии - Строка - текстовое описание (необязательный).
//   СтатусДоступа - ПеречислениеСсылка.onyx_СтатусДоступаСессии - статус видимости (необязательный).
//
// Возвращаемое значение:
//   СправочникСсылка.onyx_СессииЧата - ссылка на созданную сессию.
Функция СоздатьСессиюЧата(
	ИдентификаторАгента,
	ОписаниеСессии = "",
	СтатусДоступа = Неопределено) Экспорт
	
	Если Не onyx_ВалидацияДанных.ВалидироватьИдентификаторАгента(ИдентификаторАгента) Тогда
		ВызватьИсключение НСтр("ru='Неверный идентификатор агента при создании сессии.'");
	КонецЕсли;
	
	Если СтатусДоступа = Неопределено Тогда
		СтатусДоступа = Перечисления.onyx_СтатусДоступаСессии.Приватный;
	КонецЕсли;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("persona_id", ИдентификаторАгента);
	
	Если ЗначениеЗаполнено(ОписаниеСессии) Тогда
		ДанныеЗапроса.Вставить("description", ОписаниеСессии);
	КонецЕсли;
	
	ДанныеЗапроса.Вставить("shared_status", ПолучитьКодСтатусаДоступа(СтатусДоступа));
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Данные", ДанныеЗапроса);
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.СозданиеСессии);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.СозданиеСессии);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"POST",
		"chat/create-chat-session",
		ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.Данные) <> Тип("Структура") И ТипЗнч(Ответ.Данные) <> Тип("Соответствие") Тогда
		ВызватьИсключение НСтр("ru='Onyx не вернул данные созданной сессии.'");
	КонецЕсли;
	
	Возврат СоздатьИлиОбновитьСессию(Ответ.Данные, Истина, ИдентификаторАгента);
	
КонецФункции

// Возвращает ссылку на сессию по идентификатору Onyx.
//
// Параметры:
//   ИдентификаторСессии - УникальныйИдентификатор - идентификатор сессии Onyx.
//   Обновить - Булево - при Истина принудительно запрашивает данные из API (необязательный).
//
// Возвращаемое значение:
//   СправочникСсылка.onyx_СессииЧата - ссылка на сессию или Неопределено.
Функция ПолучитьСессиюПоИД(
	ИдентификаторСессии,
	Обновить = Ложь) Экспорт
	
	Если Не onyx_ВалидацияДанных.ВалидироватьИдентификаторСессии(ИдентификаторСессии) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = НайтиСессиюВКаталоге(ИдентификаторСессии);
	
	Если ЗначениеЗаполнено(Ссылка) И Не Обновить Тогда
		ПроверитьДоступКСессии(Ссылка);
		Возврат Ссылка;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.ПолучениеСессии);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.ПолучениеСессии);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"GET",
		"chat/get-chat-session/" + Строка(ИдентификаторСессии),
		ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.Данные) <> Тип("Структура") И ТипЗнч(Ответ.Данные) <> Тип("Соответствие") Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	// Пытаемся получить persona_id из ответа API
	ИдентификаторАгентаИзAPI = ПолучитьЗначение(Ответ.Данные, "persona_id");
	// Если в ответе нет persona_id, пытаемся получить из существующей сессии
	Если Не ЗначениеЗаполнено(ИдентификаторАгентаИзAPI) И ЗначениеЗаполнено(Ссылка) Тогда
		ИдентификаторАгентаИзAPI = Справочники.onyx_СессииЧата.ПолучитьИдентификаторАгента(Ссылка);
	КонецЕсли;
	
	Возврат СоздатьИлиОбновитьСессию(Ответ.Данные, Ложь, ИдентификаторАгентаИзAPI);
	
КонецФункции

// Отправляет сообщение в существующую сессию.
//
// Параметры:
//   ИдентификаторСессии - УникальныйИдентификатор - идентификатор сессии.
//   ТекстСообщения - Строка - содержание сообщения.
//   ИдентификаторРодительскогоСообщения - УникальныйИдентификатор - ID родительского сообщения (необязательный).
//   АдресЗадания - Строка - адрес фонового задания для отслеживания выполнения (необязательный).
//
// Возвращаемое значение:
//   Произвольный - данные, возвращенные API Onyx.
Функция ОтправитьСообщение(
	ИдентификаторСессии,
	ТекстСообщения,
	ИдентификаторРодительскогоСообщения = Неопределено,
	АдресЗадания = Неопределено) Экспорт
	
	ОшибкиВалидации = onyx_ВалидацияДанных.ВалидироватьСообщение(ТекстСообщения);
	Если ОшибкиВалидации.Количество() > 0 Тогда
		ВызватьИсключение ОшибкиВалидации[0];
	КонецЕсли;
	
	СсылкаНаСессию = ПолучитьСессиюПоИД(ИдентификаторСессии);
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		ВызватьИсключение НСтр("ru='Сессия не найдена или недоступна.'");
	КонецЕсли;
	
	ПроверитьДоступКСессии(СсылкаНаСессию);
	
	ДанныеЗапроса = Новый Соответствие;
	ДанныеЗапроса.Вставить("chat_session_id", Строка(ИдентификаторСессии));
	ДанныеЗапроса.Вставить("message", ТекстСообщения);
	
	// parent_message_id обязателен - передаём число или null
	Если ЗначениеЗаполнено(ИдентификаторРодительскогоСообщения) Тогда
		ДанныеЗапроса.Вставить("parent_message_id", ИдентификаторРодительскогоСообщения);
	Иначе
		ДанныеЗапроса.Вставить("parent_message_id", Неопределено);
	КонецЕсли;
	
	// Обязательные поля для API Onyx
	ДанныеЗапроса.Вставить("search_doc_ids", Новый Массив);
	
	ПараметрыПоиска = Новый Соответствие;
	ПараметрыПоиска.Вставить("run_search", "auto");
	ПараметрыПоиска.Вставить("real_time", Истина);
	ПараметрыПоиска.Вставить("filters", Новый Соответствие);
	ДанныеЗапроса.Вставить("retrieval_options", ПараметрыПоиска);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Данные", ДанныеЗапроса);
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.ОтправкаСообщения);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.ОтправкаСообщения);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"POST",
		"chat/send-message",
		ПараметрыЗапроса);
	
	ОбновитьМетаданныеСессии(СсылкаНаСессию);
	
	// API возвращает идентификаторы сообщений, теперь получаем сам ответ
	Результат = Новый Структура;
	Результат.Вставить("user_message_id", ПолучитьЗначение(Ответ.Данные, "user_message_id"));
	Результат.Вставить("reserved_assistant_message_id", ПолучитьЗначение(Ответ.Данные, "reserved_assistant_message_id"));
	
	// Получаем текст ответа ассистента
	ИдентификаторСообщенияАссистента = ПолучитьЗначение(Ответ.Данные, "reserved_assistant_message_id");
	Если ЕстьСвойство(Ответ.Данные, "reserved_assistant_message_id") 
		И ЗначениеЗаполнено(ИдентификаторСообщенияАссистента) Тогда
		
		ТекстОтвета = ПолучитьТекстОтветаАссистента(
			ИдентификаторСессии, 
			ИдентификаторСообщенияАссистента);
		
		Результат.Вставить("answer", ТекстОтвета);
	Иначе
		Результат.Вставить("answer", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресЗадания) Тогда 
		ПоместитьВоВременноеХранилище(Результат, АдресЗадания);
	КонецЕсли;
	
	Возврат Результат;
 
 КонецФункции
 
 Процедура ФоноваяОтправкаСообщения(Параметры) Экспорт

	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Результат = Новый Структура("Успех,Сообщение,Ответ", Истина, НСтр("ru='Сообщение отправлено.'"), Неопределено);

	Попытка
		Ответ = ОтправитьСообщение(Параметры.ИдентификаторСессии, Параметры.ТекстСообщения);
		Результат.Ответ = Ответ;
	Исключение
		Результат.Успех = Ложь;
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;

	ПоместитьВоВременноеХранилище(Результат, Параметры.КлючРезультата);

КонецПроцедуры

// Возвращает историю сообщений сессии в виде массива структур.
//
// Параметры:
//   ИдентификаторСессии - УникальныйИдентификатор - идентификатор сессии.
//   ВключатьУдаленные - Булево - признак включения удаленных сообщений (необязательный).
//
// Возвращаемое значение:
//   Массив - сообщения в формате структур.
Функция ПолучитьИсториюСессии(
	ИдентификаторСессии,
	ВключатьУдаленные = Ложь) Экспорт
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("include_deleted", ?(ВключатьУдаленные, "true", "false"));
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Параметры", Параметры);
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.ПолучениеСессии);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.ПолучениеСессии);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"GET",
		"chat/get-chat-session/" + Строка(ИдентификаторСессии),
		ПараметрыЗапроса);
	
	Сообщения = Новый Массив;
	
	Если ТипЗнч(Ответ.Данные) <> Тип("Структура") И ТипЗнч(Ответ.Данные) <> Тип("Соответствие") Тогда
		Возврат Сообщения;
	КонецЕсли;
	
	СообщенияИзAPI = ПолучитьЗначение(Ответ.Данные, "messages");
	Если ЕстьСвойство(Ответ.Данные, "messages") И ТипЗнч(СообщенияИзAPI) = Тип("Массив") Тогда
		Для Каждого СообщениеИзAPI Из СообщенияИзAPI Цикл
			Сообщения.Добавить(ПреобразоватьСообщение(СообщениеИзAPI));
		КонецЦикла;
	КонецЕсли;
	
	// Обновляем локальные данные сессии.
	// Пытаемся получить persona_id из ответа API
	ИдентификаторАгентаИзAPI = ПолучитьЗначение(Ответ.Данные, "persona_id");
	// Если persona_id нет в ответе, получаем из существующей сессии
	Если Не ЗначениеЗаполнено(ИдентификаторАгентаИзAPI) Тогда
		СсылкаСессии = НайтиСессиюВКаталоге(ИдентификаторСессии);
		Если ЗначениеЗаполнено(СсылкаСессии) Тогда
			ИдентификаторАгентаИзAPI = Справочники.onyx_СессииЧата.ПолучитьИдентификаторАгента(СсылкаСессии);
		КонецЕсли;
	КонецЕсли;
	
	СоздатьИлиОбновитьСессию(Ответ.Данные, Ложь, ИдентификаторАгентаИзAPI);
	
	Возврат Сообщения;
 
 КонецФункции

// Возвращает массив ссылок на сессии текущего пользователя.
//
// Параметры:
//   Владелец - СправочникСсылка.onyx_Агенты - фильтр по владельцу (необязательный).
//   Активные - Булево - при Истина возвращает только активные сессии (необязательный).
//
// Возвращаемое значение:
//   Массив - ссылки на элементы справочника `onyx_СессииЧата`.
Функция НайтиСессииЧата(
	Владелец = Неопределено,
	Активные = Истина) Экспорт
	
	Возврат Справочники.onyx_СессииЧата.НайтиПоПользователю(Неопределено, Владелец, Активные);
 
 КонецФункции

// Обновляет локальные метаданные сессии, выполняя запрос к API.
//
// Параметры:
//   СсылкаНаСессию - СправочникСсылка.onyx_СессииЧата - ссылка на обновляемую сессию.
Процедура ОбновитьМетаданныеСессии(СсылкаНаСессию) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Справочники.onyx_СессииЧата.ПолучитьИдентификатор(СсылкаНаСессию);
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.ПолучениеСессии);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.ПолучениеСессии);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"GET",
		"chat/get-chat-session/" + Строка(Идентификатор),
		ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.Данные) = Тип("Структура") ИЛИ ТипЗнч(Ответ.Данные) = Тип("Соответствие") Тогда
		// Пытаемся получить persona_id из ответа API
		ИдентификаторАгентаИзAPI = ПолучитьЗначение(Ответ.Данные, "persona_id");
		// Если persona_id нет в ответе, получаем из существующей сессии
		Если Не ЗначениеЗаполнено(ИдентификаторАгентаИзAPI) Тогда
			ИдентификаторАгентаИзAPI = Справочники.onyx_СессииЧата.ПолучитьИдентификаторАгента(СсылкаНаСессию);
		КонецЕсли;
		СоздатьИлиОбновитьСессию(Ответ.Данные, Ложь, ИдентификаторАгентаИзAPI);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные функции

Функция НайтиСессиюВКаталоге(ИдентификаторСессии) Экспорт
	
	Возврат Справочники.onyx_СессииЧата.НайтиПоИдентификатору(ИдентификаторСессии);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

// Создает или обновляет сессию чата на основе данных от API Onyx.
//
// Параметры:
//   ДанныеСессии - Структура - данные сессии от API Onyx.
//   Новая - Булево - признак новой сессии (необязательный).
//   ИдентификаторАгента - Число - идентификатор агента Onyx для заполнения Владелец (необязательный).
//
// Возвращаемое значение:
//   СправочникСсылка.onyx_СессииЧата - ссылка на созданную или обновленную сессию.
Функция СоздатьИлиОбновитьСессию(ДанныеСессии, Новая = Ложь, ИдентификаторАгента = Неопределено)
	
	Идентификатор = ПолучитьИдентификаторСессии(ДанныеСессии);
	Если Идентификатор = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = Справочники.onyx_СессииЧата.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Элемент = Ссылка.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.onyx_СессииЧата.СоздатьЭлемент();
		Элемент.Идентификатор = Идентификатор;
	КонецЕсли;
	
	Элемент.Наименование = ОпределитьНаименованиеСессии(ДанныеСессии);
	
	// Определяем идентификатор агента: приоритет - из данных API, затем переданный параметр, затем из существующей сессии
	ИдентификаторАгентаДляЗаполнения = ПолучитьЗначение(ДанныеСессии, "persona_id");
	Если Не ЗначениеЗаполнено(ИдентификаторАгентаДляЗаполнения) Тогда
		ИдентификаторАгентаДляЗаполнения = ИдентификаторАгента;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИдентификаторАгентаДляЗаполнения) И ЗначениеЗаполнено(Ссылка) Тогда
		ИдентификаторАгентаДляЗаполнения = Справочники.onyx_СессииЧата.ПолучитьИдентификаторАгента(Ссылка);
	КонецЕсли;
	Элемент.Владелец = ПолучитьСсылкуНаАгента(ИдентификаторАгентаДляЗаполнения);
	
	Элемент.ДатаСоздания = ПреобразоватьСтрокуВДату(ПолучитьЗначение(ДанныеСессии, "time_created"));
	Элемент.ДатаСинхронизации = ТекущаяДатаСеанса();
	Элемент.ПоследнееСообщениеID =
		ПолучитьЦелоеИлиЗначениеПоУмолчанию(
			ПолучитьЗначение(ДанныеСессии, "latest_child_message"));
	Элемент.ДатаПоследнегоСообщения =
		ПреобразоватьСтрокуВДату(ПолучитьПоследнююДатуСообщений(ДанныеСессии));
	Элемент.Активна = Не Логическое(ПолучитьЗначение(ДанныеСессии, "deleted"));
	Элемент.Пользователь = ПолучитьКлючПользователя();
	Элемент.СтатусДоступа = ПолучитьСтатусДоступаИзКода(ПолучитьЗначение(ДанныеСессии, "shared_status"));
	
	Попытка
		Элемент.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Элемент.Ссылка;
	
КонецФункции

Функция ПолучитьИдентификаторСессии(ДанныеСессии)
	
	ИдентификаторСтрока = ПолучитьЗначение(ДанныеСессии, "chat_session_id");
	Если ПустаяСтрока(ИдентификаторСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Новый УникальныйИдентификатор(ИдентификаторСтрока);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьСсылкуНаАгента(ИдентификаторАгента)
	
	Если Не onyx_ВалидацияДанных.ВалидироватьИдентификаторАгента(ИдентификаторАгента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Справочники.onyx_Агенты.НайтиПоИдентификатору(ИдентификаторАгента);
	
КонецФункции

Функция ПолучитьПоследнююДатуСообщений(ДанныеСессии)
	
	СообщенияИзAPI = ПолучитьЗначение(ДанныеСессии, "messages");
	Если ЕстьСвойство(ДанныеСессии, "messages") И ТипЗнч(СообщенияИзAPI) = Тип("Массив") Тогда
		Максимум = "";
		Для Каждого Сообщение Из СообщенияИзAPI Цикл
			Если (ТипЗнч(Сообщение) = Тип("Структура") ИЛИ ТипЗнч(Сообщение) = Тип("Соответствие")) И ЕстьСвойство(Сообщение, "time_sent") Тогда
				ВремяОтправки = ПолучитьЗначение(Сообщение, "time_sent");
				Если Максимум = "" ИЛИ ВремяОтправки > Максимум Тогда
					Максимум = ВремяОтправки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат Максимум;
	КонецЕсли;
	
	Возврат ПолучитьЗначение(ДанныеСессии, "time_updated");
	
КонецФункции

Функция ПолучитьЗначение(СтруктураJSON, ИмяПоля)
	
	Если ТипЗнч(СтруктураJSON) = Тип("Структура") И СтруктураJSON.Свойство(ИмяПоля) Тогда
		Возврат СтруктураJSON[ИмяПоля];
	ИначеЕсли ТипЗнч(СтруктураJSON) = Тип("Соответствие") Тогда
		Значение = СтруктураJSON.Получить(ИмяПоля);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	Иначе
		// Игнорируем другие типы.
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЕстьСвойство(СтруктураJSON, ИмяПоля)
	
	Если ТипЗнч(СтруктураJSON) = Тип("Структура") Тогда
		Возврат СтруктураJSON.Свойство(ИмяПоля);
	ИначеЕсли ТипЗнч(СтруктураJSON) = Тип("Соответствие") Тогда
		Возврат СтруктураJSON.Получить(ИмяПоля) <> Неопределено;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьЦелоеИлиЗначениеПоУмолчанию(Значение, ЗначениеПоУмолчанию = 0)
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Цел(Значение);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		НормализованноеЗначение = СокрЛП(Значение);
		Если СтрСоответствуетРегулярномуВыражению(НормализованноеЗначение, "^-?\d+$") Тогда
			Возврат Число(НормализованноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция УсечьСтроку(ИсходнаяСтрока, МаксимальнаяДлина) Экспорт
	
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрДлина(ИсходнаяСтрока) <= МаксимальнаяДлина Тогда
		Возврат ИсходнаяСтрока;
	КонецЕсли;
	
	Возврат Лев(ИсходнаяСтрока, МаксимальнаяДлина);
	
КонецФункции

Функция ПодготовитьТекстНаименования(ИсходныйТекст) Экспорт
	
	Если ТипЗнч(ИсходныйТекст) <> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = Строка(ИсходныйТекст);
	Результат = СтрЗаменить(Результат, Символы.ПС, " ");
	Результат = СтрЗаменить(Результат, Символы.ВК, " ");
	Результат = СокрЛП(СокрП(Результат));
	
	Пока СтрНайти(Результат, "  ") > 0 Цикл
		Результат = СтрЗаменить(Результат, "  ", " ");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьНаименованиеСессии(ДанныеСессии) Экспорт
	
	МаксимальнаяДлина = МаксимальнаяДлинаОписанияСессии();
	ОписаниеСессии = ПодготовитьТекстНаименования(ПолучитьЗначение(ДанныеСессии, "description"));
	
	Если Не ПустаяСтрока(ОписаниеСессии) Тогда
		Возврат УсечьСтроку(ОписаниеСессии, МаксимальнаяДлина);
	КонецЕсли;
	
	ПользовательскийТекст = "";
	ПервыйТекст = "";
	
	СообщенияИзAPI = ПолучитьЗначение(ДанныеСессии, "messages");
	Если ЕстьСвойство(ДанныеСессии, "messages")
		И ТипЗнч(СообщенияИзAPI) = Тип("Массив") Тогда
		
		Для Каждого Сообщение Из СообщенияИзAPI Цикл
			Если ТипЗнч(Сообщение) <> Тип("Структура") И ТипЗнч(Сообщение) <> Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли;
			
			Текст = "";
			Если ЕстьСвойство(Сообщение, "message") Тогда
				Текст = ПолучитьЗначение(Сообщение, "message");
			КонецЕсли;
			Если ПустаяСтрока(Текст)
				И ЕстьСвойство(Сообщение, "rephrased_query") Тогда
				Текст = ПолучитьЗначение(Сообщение, "rephrased_query");
			КонецЕсли;
			
			Текст = ПодготовитьТекстНаименования(Текст);
			Если ПустаяСтрока(Текст) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПустаяСтрока(ПервыйТекст) Тогда
				ПервыйТекст = Текст;
			КонецЕсли;
			
			ТипСообщения = "";
			Если ЕстьСвойство(Сообщение, "message_type") Тогда
				ТипСообщения = НРег(Строка(ПолучитьЗначение(Сообщение, "message_type")));
			КонецЕсли;
			
			Если ТипСообщения = "user" Тогда
				ПользовательскийТекст = Текст;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ПустаяСтрока(ПользовательскийТекст) Тогда
			Возврат УсечьСтроку(ПользовательскийТекст, МаксимальнаяДлина);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПервыйТекст) Тогда
			Возврат УсечьСтроку(ПервыйТекст, МаксимальнаяДлина);
		КонецЕсли;
	КонецЕсли;
	
	ИмяПерсоны = ПодготовитьТекстНаименования(ПолучитьЗначение(ДанныеСессии, "persona_name"));
	Если Не ПустаяСтрока(ИмяПерсоны) Тогда
		Возврат УсечьСтроку(ИмяПерсоны, МаксимальнаяДлина);
	КонецЕсли;
	
	Идентификатор = ПолучитьЗначение(ДанныеСессии, "chat_session_id");
	
	Если ТипЗнч(Идентификатор) = Тип("УникальныйИдентификатор") Тогда
		Возврат УсечьСтроку(Строка(Идентификатор), МаксимальнаяДлина);
	КонецЕсли;
	
	Возврат УсечьСтроку(ПодготовитьТекстНаименования(Строка(Идентификатор)), МаксимальнаяДлина);
	
КонецФункции

Функция ПреобразоватьСтрокуВДату(СтрокаДаты)
	
	Если ПустаяСтрока(СтрокаДаты) Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ПреобразоватьИСО8601(СтрокаДаты);
	
КонецФункции

Функция ПреобразоватьИСО8601(СтрокаДаты)
	
	Если ПустаяСтрока(СтрокаДаты) Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	НормализованноеЗначение = СтрЗаменить(СтрокаДаты, "Z", "");
	Разделитель = СтрНайти(НормализованноеЗначение, "T");
	Если Разделитель = 0 Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЧастьДаты = Лев(НормализованноеЗначение, Разделитель - 1);
	ЧастьВремени = Сред(НормализованноеЗначение, Разделитель + 1);
	
	СмещениеUTC = 0;
	ПозицияПлюс = СтрНайти(ЧастьВремени, "+");
	ПозицияМинус = НайтиПозициюСимволаСмещения(ЧастьВремени);
	
	Если ПозицияПлюс > 0 Тогда
		СтрокаСмещения = Сред(ЧастьВремени, ПозицияПлюс + 1);
		СмещениеUTC = ПолучитьСмещениеИзСтроки(СтрокаСмещения);
		ЧастьВремени = Лев(ЧастьВремени, ПозицияПлюс - 1);
	ИначеЕсли ПозицияМинус > 0 Тогда
		СтрокаСмещения = Сред(ЧастьВремени, ПозицияМинус + 1);
		СмещениеUTC = -ПолучитьСмещениеИзСтроки(СтрокаСмещения);
		ЧастьВремени = Лев(ЧастьВремени, ПозицияМинус - 1);
	Иначе
		// Смещение UTC отсутствует.
	КонецЕсли;
	
	МассивДата = СтрРазделить(ЧастьДаты, "-");
	МассивВремя = СтрРазделить(ЧастьВремени, ":");
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Год = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(МассивДата, ИндексГодаИСО()), Год(ТекущаяДата));
	Месяц = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(МассивДата, ИндексМесяцаИСО()), Месяц(ТекущаяДата));
	День = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(МассивДата, ИндексДняИСО()), День(ТекущаяДата));
	
	Час = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(МассивВремя, ИндексЧасаИСО()), Час(ТекущаяДата));
	Минута = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(МассивВремя, ИндексМинутыИСО()), Минута(ТекущаяДата));
	
	СекундноеЗначение = ПолучитьЭлементМассива(МассивВремя, ИндексСекундыИСО());
	Если ТипЗнч(СекундноеЗначение) = Тип("Строка") Тогда
		МассивСекунд = СтрРазделить(СекундноеЗначение, ".");
		СекундноеЗначение = ПолучитьЭлементМассива(МассивСекунд, ПервыйИндексИСО());
	КонецЕсли;
	Секунда = БезопасноеЦелоеИзСтроки(СекундноеЗначение, 0);
	
	ДатаUTC = Дата(
		Год,
		ОграничитьДиапазон(Месяц, МинимальныйМесяц(), КоличествоМесяцевВГоду()),
		ОграничитьДиапазон(День, МинимальныйДень(), МаксимальныйДеньВМесяце()),
		ОграничитьДиапазон(Час, МинимальныйЧас(), КоличествоЧасовВСутках() - 1),
		ОграничитьДиапазон(Минута, МинимальнаяМинута(), КоличествоМинутВЧасе() - 1),
		ОграничитьДиапазон(Секунда, МинимальнаяСекунда(), КоличествоСекундВМинуте() - 1));
	
	Если СмещениеUTC <> 0 Тогда
		ДатаUTC = ДатаUTC - СмещениеUTC;
	КонецЕсли;
	
	Возврат ДатаUTC + ПолучитьСмещениеЧасовогоПояса();
	
КонецФункции

Функция НайтиПозициюСимволаСмещения(СтрокаВремени)
	
	Для Индекс = 2 По СтрДлина(СтрокаВремени) Цикл
		Символ = Сред(СтрокаВремени, Индекс, 1);
		Если Символ = "-" Тогда
			Возврат Индекс;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьСмещениеИзСтроки(СтрокаСмещения)
	
	Если ПустаяСтрока(СтрокаСмещения) Тогда
		Возврат 0;
	КонецЕсли;
	
	Компоненты = СтрРазделить(СтрокаСмещения, ":");
	Час = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(Компоненты, ПервыйИндексИСО()), 0);
	Минута = БезопасноеЦелоеИзСтроки(ПолучитьЭлементМассива(Компоненты, ВторойИндексИСО()), 0);
	
	Возврат Час / КоличествоЧасовВСутках() + Минута / (КоличествоЧасовВСутках() * КоличествоМинутВЧасе());
	
КонецФункции

Функция ПолучитьСмещениеЧасовогоПояса()
	
	Попытка
		Возврат ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата();
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

Функция БезопасноеЦелоеИзСтроки(Значение, ЗначениеПоУмолчанию)
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Цел(Значение);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		НормализованнаяСтрока = СокрЛП(Значение);
		Если СтрСоответствуетРегулярномуВыражению(НормализованнаяСтрока, "^-?\d+$") Тогда
			Возврат Число(НормализованнаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция СтрСоответствуетРегулярномуВыражению(Текст, Шаблон)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Шаблон = "^\d+$" Тогда
		Возврат СтрокаСодержитТолькоЦифры(Текст);
	ИначеЕсли Шаблон = "^-?\d+$" Тогда
		Возврат СтрокаСоответствуетЦеломуСЗнаком(Текст);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СтрокаСодержитТолькоЦифры(ЗначениеСтроки)

	Если ПустаяСтрока(ЗначениеСтроки) Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Индекс = 1 По СтрДлина(ЗначениеСтроки) Цикл
		Символ = Сред(ЗначениеСтроки, Индекс, 1);
		Если Символ < "0" ИЛИ Символ > "9" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция СтрокаСоответствуетЦеломуСЗнаком(ЗначениеСтроки)

	Если ПустаяСтрока(ЗначениеСтроки) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Лев(ЗначениеСтроки, 1) = "-" Тогда
		Если СтрДлина(ЗначениеСтроки) = 1 Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат СтрокаСодержитТолькоЦифры(Сред(ЗначениеСтроки, 2));
	КонецЕсли;

	Возврат СтрокаСодержитТолькоЦифры(ЗначениеСтроки);

КонецФункции

Функция ПолучитьЭлементМассива(МассивЗначений, НомерЭлемента)
	
	Если ТипЗнч(МассивЗначений) = Тип("Массив")
		И МассивЗначений.Количество() >= НомерЭлемента Тогда
		Возврат МассивЗначений[НомерЭлемента - 1];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОграничитьДиапазон(Значение, Минимум, Максимум)
	
	Если Значение < Минимум Тогда
		Возврат Минимум;
	ИначеЕсли Значение > Максимум Тогда
		Возврат Максимум;
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

Функция ИндексГодаИСО()
	
	Возврат 1;
	
КонецФункции

Функция ИндексМесяцаИСО()
	
	Возврат 2;
	
КонецФункции

Функция ИндексДняИСО()
	
	Возврат 3;
	
КонецФункции

Функция ИндексЧасаИСО()
	
	Возврат 1;
	
КонецФункции

Функция ИндексМинутыИСО()
	
	Возврат 2;
	
КонецФункции

Функция ИндексСекундыИСО()
	
	Возврат 3;
	
КонецФункции

Функция ПервыйИндексИСО()
	
	Возврат 1;
	
КонецФункции

Функция ВторойИндексИСО()
	
	Возврат 2;
	
КонецФункции

Функция МинимальныйМесяц()
	
	Возврат 1;
	
КонецФункции

Функция КоличествоМесяцевВГоду()
	
	Возврат 12;
	
КонецФункции

Функция МинимальныйДень()
	
	Возврат 1;
	
КонецФункции

Функция МаксимальныйДеньВМесяце()
	
	Возврат 31;
	
КонецФункции

Функция МинимальныйЧас()
	
	Возврат 0;
	
КонецФункции

Функция КоличествоЧасовВСутках()
	
	Возврат 24;
	
КонецФункции

Функция МинимальнаяМинута()
	
	Возврат 0;
	
КонецФункции

Функция КоличествоМинутВЧасе()
	
	Возврат 60;
	
КонецФункции

Функция МинимальнаяСекунда()
	
	Возврат 0;
	
КонецФункции

Функция КоличествоСекундВМинуте()
	
	Возврат 60;
	
КонецФункции

Функция МаксимальнаяДлинаОписанияСессии() Экспорт
	
	Возврат 25;
	
КонецФункции

Функция ПолучитьКлючПользователя()
	
	Пользователь = Неопределено;
	Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") <> Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	ТипПользователя = ТипЗнч(Пользователь);
	
	Если ТипПользователя = Тип("СправочникСсылка.Пользователи")
		ИЛИ ТипПользователя = Тип("Пользователь") Тогда
		Возврат Пользователь.УникальныйИдентификатор();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтатусДоступаИзКода(КодСтатуса)
	
	Если НРег(Строка(КодСтатуса)) = "public" Тогда
		Возврат Перечисления.onyx_СтатусДоступаСессии.Публичный;
	КонецЕсли;
	
	Возврат Перечисления.onyx_СтатусДоступаСессии.Приватный;
	
КонецФункции

Функция ПолучитьКодСтатусаДоступа(Статус)
	
	Если Статус = Перечисления.onyx_СтатусДоступаСессии.Публичный Тогда
		Возврат "public";
	КонецЕсли;
	
	Возврат "private";
	
КонецФункции

Процедура ПроверитьДоступКСессии(СсылкаНаСессию)
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		ВызватьИсключение НСтр("ru='Сессия не найдена.'");
	КонецЕсли;
	
	Если Не Справочники.onyx_СессииЧата.ПроверитьДоступ(СсылкаНаСессию) Тогда
		ВызватьИсключение НСтр("ru='Недостаточно прав для работы с данной сессией.'");
	КонецЕсли;
	
КонецПроцедуры

// Получает текст ответа ассистента по идентификатору сообщения.
//
// Параметры:
//   ИдентификаторСессии - УникальныйИдентификатор - идентификатор сессии.
//   ИдентификаторСообщения - Число - идентификатор сообщения ассистента.
//
// Возвращаемое значение:
//   Строка - текст ответа ассистента или пустая строка.
Функция ПолучитьТекстОтветаАссистента(ИдентификаторСессии, ИдентификаторСообщения)
	
	// Делаем несколько попыток получить ответ (ассистент может генерировать текст)
	МаксимальноПопыток = 6;
	ЗадержкаСекунд = 0.7;
	
	Для НомерПопытки = 1 По МаксимальноПопыток Цикл
		
		История = ПолучитьИсториюСессии(ИдентификаторСессии);
		
		Для Каждого Сообщение Из История Цикл
			ИдентификаторСообщенияИзИстории = ПолучитьЗначение(Сообщение, "message_id");
			Если ЕстьСвойство(Сообщение, "message_id") 
				И ИдентификаторСообщенияИзИстории = ИдентификаторСообщения Тогда
				
				ТекстСообщения = ПолучитьЗначение(Сообщение, "message");
				Если ЕстьСвойство(Сообщение, "message") 
					И ЗначениеЗаполнено(ТекстСообщения) Тогда
					Возврат ТекстСообщения;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		// Если не последняя попытка, ждём
		Если НомерПопытки < МаксимальноПопыток Тогда
			ВыполнитьЗадержку(ЗадержкаСекунд);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
 
КонецФункции

// Выполняет задержку в секундах (для серверных вызовов).
//
// Параметры:
//   Секунды - Число - количество секунд задержки.
Процедура ВыполнитьЗадержку(Секунды)
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ВремяОкончания = ВремяНачала + Секунды * 1000;
	
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() < ВремяОкончания Цикл
		// Активное ожидание до достижения времени окончания.
	КонецЦикла;
	
КонецПроцедуры

Функция ПреобразоватьСообщение(ДанныеСообщения)
	
	Если ТипЗнч(ДанныеСообщения) <> Тип("Структура") И ТипЗнч(ДанныеСообщения) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	ИдентификаторСообщения = ПолучитьЗначение(ДанныеСообщения, "message_id");
	РодительскоеСообщение = ПолучитьЗначение(ДанныеСообщения, "parent_message");
	Результат.Вставить("message_id", ПолучитьЦелоеИлиЗначениеПоУмолчанию(ИдентификаторСообщения));
	Результат.Вставить("parent_message", ПолучитьЦелоеИлиЗначениеПоУмолчанию(РодительскоеСообщение));
	Результат.Вставить("message", ПолучитьЗначение(ДанныеСообщения, "message"));
	Результат.Вставить("message_type", ПолучитьЗначение(ДанныеСообщения, "message_type"));
	ВремяОтправки = ПолучитьЗначение(ДанныеСообщения, "time_sent");
	Результат.Вставить("time_sent", ПреобразоватьСтрокуВДату(ВремяОтправки));
	
	Возврат Результат;
 
 КонецФункции

Функция Логическое(Значение)
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Значение = НРег(Значение);
		Возврат Значение = "true" ИЛИ Значение = "истина" ИЛИ Значение = "1";
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение <> 0;
	КонецЕсли;
	
	Возврат Ложь;
 
 КонецФункции

#КонецОбласти
